app/Controllers/Cajas.php

    public function index($activo = 1)
    {
        if(!isset($this->session->id_usuario)){
            return redirect()->to(base_url());
        }

        $cajas = $this->cajas->where('activo', $activo)->findAll();
---
SELECT *
FROM `cajas`
WHERE `activo` = 1