app/Controllers/Mesas.php

SELECT *
FROM `mesas`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        if(!isset($this->session->id_usuario)){
            return redirect()->to(base_url());
        }

        $mesas = $this->mesas->where('activo', $activo)->findAll();