app/Models/VentasModel.php

    public function totalDia($fecha){
        $this->select("sum(total) AS total");
        $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";
        return $this->where($where)->first();
---
SELECT sum(total) AS total
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2025-04-22'
 LIMIT 1